In [95]:
import numpy as np
import pandas as pd

In [96]:
from numpy.random import randn
np.random.seed(101)

In [97]:
df = pd.DataFrame(randn(5, 4), index='A B C D E'.split(), columns=' W X Y Z'.split())

In [98]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [99]:
bol = df > 0
df[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [100]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [101]:
df[df['Y']>0]['Y']

A    0.907969
C    0.528813
E    2.605967
Name: Y, dtype: float64

In [102]:
bol = df['W'] > 0
df = df[bol]
df['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [103]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [105]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     D  0.188695 -0.758872 -0.933237  0.955057
3     E  0.190794  1.978757  2.605967  0.683509

In [110]:
col = 'RS SP SC PI'.split()

In [111]:
col

['RS', 'SP', 'SC', 'PI']

In [112]:
df['ESTADOS'] = col

In [114]:
df

          W         X         Y         Z ESTADOS
A  2.706850  0.628133  0.907969  0.503826      RS
B  0.651118 -0.319318 -0.848077  0.605965      SP
D  0.188695 -0.758872 -0.933237  0.955057      SC
E  0.190794  1.978757  2.605967  0.683509      PI

In [119]:
df.set_index('ESTADOS')

                W         X         Y         Z
ESTADOS
RS       2.706850  0.628133  0.907969  0.503826
SP       0.651118 -0.319318 -0.848077  0.605965
SC       0.188695 -0.758872 -0.933237  0.955057
PI       0.190794  1.978757  2.605967  0.683509

In [122]:
df.set_index('ESTADOS', inplace=True)
df

                W         X         Y         Z
ESTADOS
RS       2.706850  0.628133  0.907969  0.503826
SP       0.651118 -0.319318 -0.848077  0.605965
SC       0.188695 -0.758872 -0.933237  0.955057
PI       0.190794  1.978757  2.605967  0.683509